AgusBM/esp32-s3-jarvis-hid/sdkconfig.defaults.esp32s3
# ESP32-S3 Jarvis HID configuration for ESP-IDF v5.0.8
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SR_VADN_VADNET1_MEDIUM=y
CONFIG_SR_WN_WN9_HILEXIN=y
CONFIG_SR_WN_WN9_JARVIS_TTS=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# USB HID (TinyUSB) - no Bluetooth needed
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_BT_ENABLED=n
